Revit 2026 API

# Hardwood Class

---

A static class that provides access to the property names that appear in the Hardwood visual asset schema.

SystemObject Autodesk.Revit.DB.VisualHardwood

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class Hardwood
```
```vb
Public NotInheritable Class Hardwood
```
```cpp
public ref class Hardwood abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Hardwood = class end
```

The Hardwood type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "Hardwood" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "Hardwood" schema. |
|  | HardwoodApplication | The property labeled "Used For" from the "Hardwood" schema. |
|  | HardwoodColor | The property labeled "Image" from the "Hardwood" schema. |
|  | HardwoodFinish | The property labeled "Finish" from the "Hardwood" schema. |
|  | HardwoodImperfections | The property labeled "Relief Pattern" from the "Hardwood" schema. |
|  | HardwoodImperfectionsAmount | The property labeled "Amount" from the "Hardwood" schema. |
|  | HardwoodImperfectionsShader | The property labeled "Image" from the "Hardwood" schema. |
|  | HardwoodTintColor | The property labeled "Stain Color" from the "Hardwood" schema. |
|  | HardwoodTintEnabled | The property labeled "Stain" from the "Hardwood" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace